BlaineMoon30/STM32H723_Nucleo_Cube_AI_Multi_Model_Example/stm32h723_cube_ai_multi_model.ioc
#MicroXplorer Configuration settings - do not modify
CORTEX_M7.CPU_DCache=Enabled
CORTEX_M7.CPU_ICache=Enabled
CORTEX_M7.IPParameters=CPU_ICache,CPU_DCache
File.Version=6
GPIO.groupedBy=
KeepUserPlacement=false
Mcu.CPN=STM32H723ZGT6
Mcu.Family=STM32H7
Mcu.IP0=CORTEX_M7
Mcu.IP1=CRC
Mcu.IP2=DEBUG
Mcu.IP3=NVIC
Mcu.IP4=RCC
Mcu.IP5=SYS
Mcu.IPNb=6
Mcu.Name=STM32H723ZGTx
Mcu.Package=LQFP144
Mcu.Pin0=PH0-OSC_IN
Mcu.Pin1=PA13(JTMS/SWDIO)
Mcu.Pin2=PA14(JTCK/SWCLK)
Mcu.Pin3=VP_CRC_VS_CRC
Mcu.Pin4=VP_SYS_VS_Systick
Mcu.Pin5=VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_7.2.0
Mcu.Pin6=VP_STMicroelectronics.X-CUBE-AI_VS_DeviceJjApplication_7.2.0
Mcu.PinsNb=7
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-AI.7.2.0
Mcu.ThirdPartyNb=1
Mcu.UserConstants=
Mcu.UserName=STM32H723ZGTx
MxCube.Version=6.6.1
MxDb.Version=DB.6.0.60
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA13(JTMS/SWDIO).Mode=Serial_Wire
PA13(JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
PA14(JTCK/SWCLK).Mode=Serial_Wire
PA14(JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PH0-OSC_IN.Mode=HSE-External-Clock-Source
PH0-OSC_IN.Signal=RCC_OSC_IN
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32H723ZGTx
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.10.0
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x800
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=STM32CubeIDE
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=stm32h723_cube_ai_multi_model.ioc
ProjectManager.ProjectName=stm32h723_cube_ai_multi_model
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x800
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.ToolChainLocation=
ProjectManager.UnderRoot=true
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false,2-MX_GPIO_Init-GPIO-false-HAL-true,3-MX_CRC_Init-CRC-false-HAL-true,5-MX_X_CUBE_AI_Init-STMicroelectronics.X-CUBE-AI.7.2.0-false-HAL-false,6-MX_X_CUBE_AI_Process-STMicroelectronics.X-CUBE-AI.7.2.0-false-HAL-false,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
RCC.ADCFreq_Value=608000000
RCC.AHB12Freq_Value=275000000
RCC.AHB4Freq_Value=275000000
RCC.APB1Freq_Value=137500000
RCC.APB2Freq_Value=137500000
RCC.APB3Freq_Value=137500000
RCC.APB4Freq_Value=137500000
RCC.AXIClockFreq_Value=275000000
RCC.CECFreq_Value=32000
RCC.CKPERFreq_Value=64000000
RCC.CortexFreq_Value=550000000
RCC.CpuClockFreq_Value=550000000
RCC.D1CPREFreq_Value=550000000
RCC.D1PPRE=RCC_APB3_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D3PPRE=RCC_APB4_DIV2
RCC.DFSDMACLkFreq_Value=137500000
RCC.DFSDMFreq_Value=137500000
RCC.DIVM1=4
RCC.DIVM2=1
RCC.DIVN1=34
RCC.DIVN2=19
RCC.DIVP1=1
RCC.DIVP1Freq_Value=550000000
RCC.DIVP2Freq_Value=608000000
RCC.DIVP3Freq_Value=129000000
RCC.DIVQ1=4
RCC.DIVQ1Freq_Value=137500000
RCC.DIVQ2Freq_Value=608000000
RCC.DIVQ3Freq_Value=129000000
RCC.DIVR1Freq_Value=275000000
RCC.DIVR2Freq_Value=608000000
RCC.DIVR3Freq_Value=129000000
RCC.FDCANFreq_Value=137500000
RCC.FMCFreq_Value=275000000
RCC.FamilyName=M
RCC.HCLK3ClockFreq_Value=275000000
RCC.HCLKFreq_Value=275000000
RCC.HPRE=RCC_HCLK_DIV2
RCC.HSE_VALUE=8000000
RCC.I2C123Freq_Value=137500000
RCC.I2C4Freq_Value=137500000
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVN1,DIVN2,DIVP1,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL2FRACN,PLL3FRACN,PLLFRACN,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
RCC.LPTIM1Freq_Value=137500000
RCC.LPTIM2Freq_Value=137500000
RCC.LPTIM345Freq_Value=137500000
RCC.LPUART1Freq_Value=137500000
RCC.LTDCFreq_Value=129000000
RCC.MCO1PinFreq_Value=64000000
RCC.MCO2PinFreq_Value=550000000
RCC.PLL2FRACN=0
RCC.PLL3FRACN=0
RCC.PLLFRACN=3072
RCC.QSPIFreq_Value=275000000
RCC.RNGFreq_Value=48000000
RCC.RTCFreq_Value=32000
RCC.SAI1Freq_Value=137500000
RCC.SAI4AFreq_Value=137500000
RCC.SAI4BFreq_Value=137500000
RCC.SDMMCFreq_Value=137500000
RCC.SPDIFRXFreq_Value=137500000
RCC.SPI123Freq_Value=137500000
RCC.SPI45Freq_Value=137500000
RCC.SPI6Freq_Value=137500000
RCC.SWPMI1Freq_Value=137500000
RCC.SYSCLKFreq_VALUE=550000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.Tim1OutputFreq_Value=275000000
RCC.Tim2OutputFreq_Value=275000000
RCC.TraceFreq_Value=275000000
RCC.USART16Freq_Value=137500000
RCC.USART234578Freq_Value=137500000
RCC.USBCLockSelection=RCC_USBCLKSOURCE_HSI48
RCC.USBFreq_Value=48000000
RCC.VCO1OutputFreq_Value=550000000
RCC.VCO2OutputFreq_Value=1216000000
RCC.VCO3OutputFreq_Value=258000000
RCC.VCOInput1Freq_Value=16000000
RCC.VCOInput2Freq_Value=64000000
RCC.VCOInput3Freq_Value=2000000
STMicroelectronics.X-CUBE-AI.7.2.0.ActivationBufferSizeList=2440,2440
STMicroelectronics.X-CUBE-AI.7.2.0.ActivationBuffers=pool0;pool0
STMicroelectronics.X-CUBE-AI.7.2.0.ActivationNames=pool0
STMicroelectronics.X-CUBE-AI.7.2.0.ActivationSizes=AI_MODEL_1_DATA_ACTIVATION_1_SIZE
STMicroelectronics.X-CUBE-AI.7.2.0.ApplicationCcDeviceJjApplication=ApplicationTemplate
STMicroelectronics.X-CUBE-AI.7.2.0.ArtificialOoIntelligenceJjXAaCUBEAaAI_Checked=true
STMicroelectronics.X-CUBE-AI.7.2.0.DeviceJjApplication_Checked=true
STMicroelectronics.X-CUBE-AI.7.2.0.HeapSize=0x800
STMicroelectronics.X-CUBE-AI.7.2.0.IPParameters=XAaCUBEAaAICcArtificialOoIntelligenceJjCore,ApplicationCcDeviceJjApplication,HeapSize,StackSize,ModelName-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0,ModelType-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0,ModelKind-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0,ModelCompression-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0,ModelHashList,ModelNameList,WorkingBufferStartAddrList,LatestDirectoryUsed-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0,ModelStructureFile-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0,ModelMacc-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0,ModelActualCompression-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0,ModelRamOccupation-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0,ModelFlashOccupation-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0,ModelName-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983,ModelType-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983,ModelKind-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983,ModelCompression-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983,LatestDirectoryUsed-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983,ModelStructureFile-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983,ModelMacc-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983,ModelActualCompression-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983,ModelRamOccupation-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983,ModelFlashOccupation-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983,ActivationBuffers,ActivationSizes,ActivationNames,InternalRamActivationBufferMaxSize,ActivationBufferSizeList,MaximumNumberOfInputLayer,MaximumNumberOfOutputLayer,MaximumSizeOfInputLayer,MaximumSizeOfOutputLayer,ReadyForCodeGeneration
STMicroelectronics.X-CUBE-AI.7.2.0.InternalRamActivationBufferMaxSize=AI_MODEL_1_DATA_ACTIVATIONS_SIZE
STMicroelectronics.X-CUBE-AI.7.2.0.LatestDirectoryUsed-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983=C\:\\_Blaine\\WorkSpace\\STM32H723_CubeAI_Multi_Model\\AI_Sample_Script
STMicroelectronics.X-CUBE-AI.7.2.0.LatestDirectoryUsed-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0=C\:\\_Blaine\\WorkSpace\\STM32H723_CubeAI_Multi_Model\\AI_Sample_Script
STMicroelectronics.X-CUBE-AI.7.2.0.MaximumNumberOfInputLayer=1
STMicroelectronics.X-CUBE-AI.7.2.0.MaximumNumberOfOutputLayer=1
STMicroelectronics.X-CUBE-AI.7.2.0.MaximumSizeOfInputLayer=1
STMicroelectronics.X-CUBE-AI.7.2.0.MaximumSizeOfOutputLayer=1
STMicroelectronics.X-CUBE-AI.7.2.0.ModelActualCompression-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983=0.0
STMicroelectronics.X-CUBE-AI.7.2.0.ModelActualCompression-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0=0.0
STMicroelectronics.X-CUBE-AI.7.2.0.ModelCompression-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983=None
STMicroelectronics.X-CUBE-AI.7.2.0.ModelCompression-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0=None
STMicroelectronics.X-CUBE-AI.7.2.0.ModelFlashOccupation-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983=34204
STMicroelectronics.X-CUBE-AI.7.2.0.ModelFlashOccupation-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0=34204
STMicroelectronics.X-CUBE-AI.7.2.0.ModelHashList=97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0;7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983
STMicroelectronics.X-CUBE-AI.7.2.0.ModelKind-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983=KERAS
STMicroelectronics.X-CUBE-AI.7.2.0.ModelKind-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0=KERAS
STMicroelectronics.X-CUBE-AI.7.2.0.ModelMacc-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983=5249
STMicroelectronics.X-CUBE-AI.7.2.0.ModelMacc-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0=5249
STMicroelectronics.X-CUBE-AI.7.2.0.ModelName-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983=model_2
STMicroelectronics.X-CUBE-AI.7.2.0.ModelName-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0=model_1
STMicroelectronics.X-CUBE-AI.7.2.0.ModelNameList=model_1,model_2
STMicroelectronics.X-CUBE-AI.7.2.0.ModelRamOccupation-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983=2440
STMicroelectronics.X-CUBE-AI.7.2.0.ModelRamOccupation-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0=2440
STMicroelectronics.X-CUBE-AI.7.2.0.ModelStructureFile-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983=/C\:/_Blaine/WorkSpace/STM32H723_CubeAI_Multi_Model/AI_Sample_Script/housing.h5
STMicroelectronics.X-CUBE-AI.7.2.0.ModelStructureFile-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0=/C\:/_Blaine/WorkSpace/STM32H723_CubeAI_Multi_Model/AI_Sample_Script/housing.h5
STMicroelectronics.X-CUBE-AI.7.2.0.ModelType-7af2778f519ada0175976ba08d0dd446adbb6a69cecbb65d72cd77fc190db983=Saved model
STMicroelectronics.X-CUBE-AI.7.2.0.ModelType-97fc22beca45ad4f810b14dfbe674357675ef26e4eba99b3890e422a9f2d4ba0=Saved model
STMicroelectronics.X-CUBE-AI.7.2.0.ReadyForCodeGeneration=true
STMicroelectronics.X-CUBE-AI.7.2.0.StackSize=0x800
STMicroelectronics.X-CUBE-AI.7.2.0.WorkingBufferStartAddrList=0xFFFFFFFF,0xFFFFFFFF
STMicroelectronics.X-CUBE-AI.7.2.0.XAaCUBEAaAICcArtificialOoIntelligenceJjCore=true
STMicroelectronics.X-CUBE-AI.7.2.0_SwParameter=ApplicationCcDeviceJjApplication\:ApplicationTemplate;XAaCUBEAaAICcArtificialOoIntelligenceJjCore\:true;
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_7.2.0.Mode=ArtificialOoIntelligenceJjXAaCUBEAaAI
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_7.2.0.Signal=STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_7.2.0
VP_STMicroelectronics.X-CUBE-AI_VS_DeviceJjApplication_7.2.0.Mode=DeviceJjApplication
VP_STMicroelectronics.X-CUBE-AI_VS_DeviceJjApplication_7.2.0.Signal=STMicroelectronics.X-CUBE-AI_VS_DeviceJjApplication_7.2.0
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=custom
